import { nanoid } from 'nanoid';

const reviews = [
  {
    id: nanoid(),
    author: 'Іван Петров',
    rating: 5,
    age: 20,
    comment:
      'Чудовий досвід! Обслуговування було відмінним, а персонал дуже дружелюбний. Я відразу рекомендую це місце.',
  },
  {
    id: nanoid(),
    author: 'Олена Коваль',
    rating: 4,
    age: 21,
    comment:
      "Я чудово провела час тут. Їжа була смачною, а атмосфера - затишною. Обов'язково повернусь знову.",
  },
  {
    id: nanoid(),
    author: 'Михайло Іваненко',
    rating: 5,
    age: 34,
    comment:
      'Дивовижне обслуговування! Персонал пішов вище і далі, щоб переконатися, що ми мали фантастичний досвід. Я не можу дочекатися наступного візиту.',
  },
  {
    id: nanoid(),
    author: 'Олена Сидоренко',
    rating: 3,
    age: 46,
    comment:
      'Їжа була непоганою, але обслуговування трохи повільне. В цілому, це був нормальний досвід.',
  },
  {
    id: nanoid(),
    author: 'Давид Васильчук',
    rating: 5,
    age: 26,
    comment:
      "Абсолютно в захваті! Їжа була смачною, а атмосфера - ідеальною. Обов'язково рекомендую це будь-кому.",
  },
];

export const getReviews = () => {
  return reviews;
};

export const getReviewById = id => {
  return reviews.find(review => review.id === id);
};
